eisup_2019_docmng_integration/src/Documents/ttk_ЗаявкаНаОтгрузку/ttk_ЗаявкаНаОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_ЗаявкаНаОтгрузку</name>
  <attributes>
    <name>Основание</name>
    <type>
      <types>EnumRef.ttk_ВидыОснованийЗаявкиНаОтгрузку</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторОтгрузки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПередачаТоваров</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>DocumentRef.абс_АВИЗО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccumulationRegisters/ПартииТоваровНаСкладахБухгалтерскийУчет/ПартииТоваровНаСкладахБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПартииТоваровНаСкладахБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Регламентный документ, сформировавший движения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийПартииТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвиженияПериод</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиСписанныхТоваров</name>
    <comment>Индекс строки списанных товаров</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОприходования</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.ВозвратМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.ОприходованиеМатериаловИзПроизводства</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийТоварыНаСкладах</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/ТоварыВРезервеНаСкладах/ТоварыВРезервеНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВРезервеНаСкладах</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРезерва</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Documents/ttk_ЗаявкаНаОтгрузку/Forms/ФормаПодбораНоменклатуры/Module.bsl
&НаКлиенте
Процедура ЗаполнитьДерево(Команда)
	ЗаполнитьДеревоСервер();
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьДеревоСервер()
	
	
	
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.Склад,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.ДокументОприходования КАК ДокументОприходования,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.Номенклатура,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.ХарактеристикаНоменклатуры,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.СерияНоменклатуры,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.ДокументОприходования.абс_ЗакупочныйЗаказ КАК ЗакупочныйЗаказ,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.СчетУчета,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.Заказ,
               |	СУММА(ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.КоличествоОстаток) КАК КоличествоОстаток
               |ПОМЕСТИТЬ ОстаткиПартииБУ
               |ИЗ
               |	РегистрНакопления.ПартииТоваровНаСкладахБухгалтерскийУчет.Остатки(
               |			,
               |			ВЫБОР
               |					КОГДА НЕ &Склад = НЕОПРЕДЕЛЕНО
               |						ТОГДА Склад = &Склад
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ
               |				И ВЫБОР
               |					КОГДА НЕ &ДокументОприходования = НЕОПРЕДЕЛЕНО
               |						ТОГДА ДокументОприходования = &ДокументОприходования
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ
               |				И ВЫБОР
               |					КОГДА НЕ &Номенклатура = НЕОПРЕДЕЛЕНО
               |						ТОГДА Номенклатура = &Номенклатура
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ
               |				И ВЫБОР
               |					КОГДА НЕ &Организация = НЕОПРЕДЕЛЕНО
               |						ТОГДА Организация = &Организация
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ
               |				И ВЫБОР
               |					КОГДА НЕ &НоменклатураНаименование = """"
               |						ТОГДА Номенклатура.НаименованиеПолное ПОДОБНО &НоменклатураНаименование
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ
               |				И ВЫБОР
               |					КОГДА НЕ &НоменклатураКод = """"
               |						ТОГДА Номенклатура.Код ПОДОБНО &НоменклатураКод
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ
               |				И ВЫБОР
               |					КОГДА НЕ &СерияНаименование = """"
               |						ТОГДА СерияНоменклатуры.Наименование ПОДОБНО &СерияНаименование
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ
               |				И ВЫБОР
               |					КОГДА НЕ &ХарактеристикаНаименование = """"
               |						ТОГДА ХарактеристикаНоменклатуры.Наименование ПОДОБНО &ХарактеристикаНаименование
               |					ИНАЧЕ ИСТИНА
               |				КОНЕЦ) КАК ПартииТоваровНаСкладахБухгалтерскийУчетОстатки
               |ГДЕ
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.КоличествоОстаток >= 0
               |
               |СГРУППИРОВАТЬ ПО
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.Склад,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.ДокументОприходования,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.Номенклатура,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.ХарактеристикаНоменклатуры,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.СерияНоменклатуры,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.ДокументОприходования.абс_ЗакупочныйЗаказ,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.СчетУчета,
               |	ПартииТоваровНаСкладахБухгалтерскийУчетОстатки.Заказ
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ
               |	ОстаткиПартииБУ.Склад,
               |	ОстаткиПартииБУ.ДокументОприходования КАК ДокументОприходования,
               |	ОстаткиПартииБУ.Номенклатура,
               |	ОстаткиПартииБУ.ХарактеристикаНоменклатуры,
               |	ОстаткиПартииБУ.СерияНоменклатуры,
               |	ОстаткиПартииБУ.ЗакупочныйЗаказ,
               |	ОстаткиПартииБУ.СчетУчета,
               |	ОстаткиПартииБУ.Заказ,
               |	ОстаткиПартииБУ.КоличествоОстаток КАК КоличествоОстаток,
               |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)) КАК ТоварыНаСкладахОстаток
               |ПОМЕСТИТЬ ВТ_1
               |ИЗ
               |	ОстаткиПартииБУ КАК ОстаткиПартииБУ
               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки( ) КАК ТоварыНаСкладахОстатки
               |		ПО ОстаткиПартииБУ.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
               |			И ОстаткиПартииБУ.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
               |			И ОстаткиПартииБУ.СерияНоменклатуры = ТоварыНаСкладахОстатки.СерияНоменклатуры
               |			И ОстаткиПартииБУ.Склад = ТоварыНаСкладахОстатки.Склад
               |
               |СГРУППИРОВАТЬ ПО
               |	ОстаткиПартииБУ.Склад,
               |	ОстаткиПартииБУ.ДокументОприходования,
               |	ОстаткиПартииБУ.Номенклатура,
               |	ОстаткиПартииБУ.ХарактеристикаНоменклатуры,
               |	ОстаткиПартииБУ.СерияНоменклатуры,
               |	ОстаткиПартииБУ.ЗакупочныйЗаказ,
               |	ОстаткиПартииБУ.СчетУчета,
               |	ОстаткиПартииБУ.Заказ,
               |	ОстаткиПартииБУ.КоличествоОстаток
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ
               |	ВТ_1.Склад,
               |	ВТ_1.ДокументОприходования,
               |	ВТ_1.Номенклатура,
               |	ВТ_1.ХарактеристикаНоменклатуры,
               |	ВТ_1.СерияНоменклатуры,
               |	ВТ_1.ЗакупочныйЗаказ,
               |	ВТ_1.СчетУчета,
               |	ВТ_1.Заказ,
               |	СУММА(ВТ_1.КоличествоОстаток) КАК КоличествоОстаток,
               |	СУММА(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК ТоварыНаСкладахВРезерве,
               |	СУММА(ВТ_1.ТоварыНаСкладахОстаток) КАК ТоварыНаСкладахОстаток
               |ПОМЕСТИТЬ ВТ_2
               |ИЗ
               |	ВТ_1 КАК ВТ_1
               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ) КАК ТоварыВРезервеНаСкладахОстатки
               |		ПО ВТ_1.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
               |			И ВТ_1.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
               |			И ВТ_1.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
               |			И ВТ_1.СерияНоменклатуры = ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры
               |
               |СГРУППИРОВАТЬ ПО
               |	ВТ_1.Склад,
               |	ВТ_1.ДокументОприходования,
               |	ВТ_1.Номенклатура,
               |	ВТ_1.ХарактеристикаНоменклатуры,
               |	ВТ_1.СерияНоменклатуры,
               |	ВТ_1.ЗакупочныйЗаказ,
               |	ВТ_1.СчетУчета,
               |	ВТ_1.Заказ
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ
               |	ВТ_2.Склад,
               |	ВТ_2.ДокументОприходования КАК ДокументОприходования,
               |	ВТ_2.Номенклатура,
               |	ВТ_2.ХарактеристикаНоменклатуры,
               |	ВТ_2.СерияНоменклатуры,
               |	ВТ_2.ЗакупочныйЗаказ,
               |	ВТ_2.СчетУчета,
               |	ВТ_2.Заказ,
               |	СУММА(ВТ_2.КоличествоОстаток) КАК КоличествоОстаток,
               |	СУММА(ВТ_2.ТоварыНаСкладахОстаток) КАК ТоварыНаСкладахОстаток,
               |	СУММА(ВТ_2.ТоварыНаСкладахВРезерве) КАК ТоварыНаСкладахВРезерве
               |ИЗ
               |	ВТ_2 КАК ВТ_2
               |
               |СГРУППИРОВАТЬ ПО
               |	ВТ_2.Склад,
               |	ВТ_2.ДокументОприходования,
               |	ВТ_2.Номенклатура,
               |	ВТ_2.ХарактеристикаНоменклатуры,
               |	ВТ_2.СерияНоменклатуры,
               |	ВТ_2.ЗакупочныйЗаказ,
               |	ВТ_2.СчетУчета,
               |	ВТ_2.Заказ
               |ИТОГИ
               |	СУММА(КоличествоОстаток),
               |	СУММА(ТоварыНаСкладахОстаток),
               |	СУММА(ТоварыНаСкладахВРезерве)
               |ПО
               |	ДокументОприходования";


Если  ЗначениеЗаполнено(ЭтаФорма.ОтборСклад) Тогда
	Запрос.УстановитьПараметр("Склад",	 ЭтаФорма.ОтборСклад);
Иначе
	Запрос.УстановитьПараметр("Склад", Неопределено);
КонецЕсли;

Если  ЗначениеЗаполнено(ЭтаФорма.ОтборДокументОприходования) Тогда
	Запрос.УстановитьПараметр("ДокументОприходования",	 ЭтаФорма.ОтборДокументОприходования);
Иначе
	Запрос.УстановитьПараметр("ДокументОприходования",	 Неопределено);
КонецЕсли;

Если  ЗначениеЗаполнено(ЭтаФорма.ОтборОрганизация) Тогда
	Запрос.УстановитьПараметр("Организация",	 ЭтаФорма.ОтборОрганизация);
Иначе
	Запрос.УстановитьПараметр("Организация",	 Неопределено);
КонецЕсли;

Если  ЗначениеЗаполнено(ЭтаФорма.ОтборНоменклатура) Тогда
	Запрос.УстановитьПараметр("Номенклатура",	 ЭтаФорма.ОтборНоменклатура);
Иначе
	Запрос.УстановитьПараметр("Номенклатура",	 Неопределено);
КонецЕсли;


Если  ЗначениеЗаполнено(СокрЛП(ЭтаФорма.ОтборНоменклатураНаименование)) Тогда
	Запрос.УстановитьПараметр("НоменклатураНаименование",	"%" + СокрЛП(ЭтаФорма.ОтборНоменклатураНаименование) + "%" );
Иначе
	Запрос.УстановитьПараметр("НоменклатураНаименование",	 "");
КонецЕсли;

Если  ЗначениеЗаполнено(СокрЛП(ЭтаФорма.ОтборНоменклатураКод)) Тогда
	Запрос.УстановитьПараметр("НоменклатураКод",	"%" + СокрЛП(ЭтаФорма.ОтборНоменклатураКод) + "%" );
Иначе
	Запрос.УстановитьПараметр("НоменклатураКод",	 "");
КонецЕсли;

Если  ЗначениеЗаполнено(СокрЛП(ЭтаФорма.ОтборСерияНаименование)) Тогда
	Запрос.УстановитьПараметр("СерияНаименование",	"%" + СокрЛП(ЭтаФорма.ОтборСерияНаименование) + "%" );
Иначе
	Запрос.УстановитьПараметр("СерияНаименование",	 "");
КонецЕсли;


Если  ЗначениеЗаполнено(СокрЛП(ЭтаФорма.ОтборХарактеристикаНаименование)) Тогда
	Запрос.УстановитьПараметр("ХарактеристикаНаименование",	"%" + СокрЛП(ЭтаФорма.ОтборХарактеристикаНаименование) + "%" );
Иначе
	Запрос.УстановитьПараметр("ХарактеристикаНаименование",	 "");
КонецЕсли;





//Выгрузим результат запроса в Табличное Поле с Типом значения Дерево значений	

ДеревоЗнчСервер =РеквизитФормыВзначение("ДеревоЗнч",Тип("ДеревоЗначений"));

ДеревоЗнчСервер.Строки.Очистить();



Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);


Пока Выборка.Следующий() Цикл
	
	
        СтрокаДокументоприходывания = ДеревоЗнчСервер.Строки.Добавить();
        СтрокаДокументоприходывания.ДокументОприходования = Выборка.ДокументОприходования;
		ЗаполнитьЗначенияСвойств(СтрокаДокументоприходывания,Выборка);
		
		СтрокаДокументоприходывания.ТоварыНаСкладахОстаток 			= Выборка.ТоварыНаСкладахОстаток;
		СтрокаДокументоприходывания.ТоварыНаСкладахВРезерве 		= Выборка.ТоварыНаСкладахВРезерве;
		СтрокаДокументоприходывания.ТоварыНаСкладахСвободныйОстаток = Выборка.ТоварыНаСкладахОстаток - Выборка.ТоварыНаСкладахВРезерве;
		
		ВыборкаДетальныеСтроки= Выборка.Выбрать();
		
		Пока ВыборкаДетальныеСтроки.Следующий() Цикл
			
			СтрокаДетальная = СтрокаДокументоприходывания.Строки.Добавить();
			
			СтрокаДетальная.Номенклатура 				= ВыборкаДетальныеСтроки.Номенклатура;
			СтрокаДетальная.ХарактеристикаНоменклатуры  = ВыборкаДетальныеСтроки.ХарактеристикаНоменклатуры;
			СтрокаДетальная.СерияНоменклатуры			= ВыборкаДетальныеСтроки.СерияНоменклатуры;
			СтрокаДетальная.ЗакупочныйЗаказ 			= ВыборкаДетальныеСтроки.ЗакупочныйЗаказ;
			СтрокаДетальная.СчетУчета 					= ВыборкаДетальныеСтроки.СчетУчета;
			СтрокаДетальная.Заказ 						= ВыборкаДетальныеСтроки.Заказ;
			СтрокаДетальная.КоличествоОстаток 			= ВыборкаДетальныеСтроки.КоличествоОстаток;
			
			СтрокаДетальная.ТоварыНаСкладахОстаток 			= ВыборкаДетальныеСтроки.ТоварыНаСкладахОстаток;
			СтрокаДетальная.ТоварыНаСкладахВРезерве 		= ВыборкаДетальныеСтроки.ТоварыНаСкладахВРезерве;
			СтрокаДетальная.ТоварыНаСкладахСвободныйОстаток = ВыборкаДетальныеСтроки.ТоварыНаСкладахОстаток- ВыборкаДетальныеСтроки.ТоварыНаСкладахВРезерве;	
				
        КонецЦикла;
		
		
		
КонецЦикла;

ЗначениеВреквизитФормы(ДеревоЗнчСервер,"ДеревоЗнч");
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 ЭтаФорма.ОтборСклад 			= Параметры.Склад; 
	 ЗаполнитьДеревоСервер();
	 
КонецПроцедуры

&НаКлиенте
Процедура СвернутьСтроки(Команда)
	
		 КоллекцияЭлементовДерева=ДеревоЗнч.ПолучитьЭлементы();
		//Свернуть дерево 
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		     ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		     Элементы.ДеревоЗнч.Свернуть(ИдентификаторСтроки);
		 КонецЦикла;
		 
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСтроки(Команда)
	
	 КоллекцияЭлементовДерева=ДеревоЗнч.ПолучитьЭлементы();

	//Развернуть дерево 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
	    ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
	    Элементы.ДеревоЗнч.Развернуть(ИдентификаторСтроки);
	КонецЦикла;   
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	

	Оповестить("ПодборНоменклатурыДляРезерва" ,ЭтаФорма , ЭтаФорма.ВладелецФормы); 
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗнчВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) = Ложь Тогда
		Возврат;	
	КонецЕсли;
	
	НовСтрока =  ЭтаФорма.ТаблицаВыбора.Добавить();
	
	НовСтрока.Номенклатура 					= 	Элемент.ТекущиеДанные.Номенклатура;
	НовСтрока.ХарактеристикаНоменклатуры 	=	Элемент.ТекущиеДанные.ХарактеристикаНоменклатуры;	
	НовСтрока.СерияНоменклатуры           	=   Элемент.ТекущиеДанные.СерияНоменклатуры;
	НовСтрока.Количество 					= 	1;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		
		Для каждого Элемент Из ПараметрыПеретаскивания.Значение Цикл
			
			НоваяСтрокаТЧ=ЭтаФорма.ТаблицаВыбора.Добавить();
			
			НоваяСтрокаТЧ.Номенклатура 						= Элемент.Номенклатура; 
			НоваяСтрокаТЧ.ХарактеристикаНоменклатуры 		= Элемент.ХарактеристикаНоменклатуры; 
			НоваяСтрокаТЧ.СерияНоменклатуры 				= Элемент.СерияНоменклатуры; 
			НоваяСтрокаТЧ.Количество 						= 	1;
			                                    	
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры
